running-linux-on-a-macbook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-09 Wed 23:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Running Linux on a MacBook</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tanner Hoelzel" />
</head>
<body>
<div id="content">
<h1 class="title">Running Linux on a MacBook</h1>
<p>
There are many existing resources for installing and running Linux on
Apple hardware. This guide attempts to serve as a table of contents
for those resources, with additional tips and context included.
</p>

<p>
Disclaimer: every single time I have adjusted the boot process of my
macbook, something horrible has at some point seemed to occur: the
laptop bricked, macOS partition corrupted, etc. That being said, the
situation has always been recoverable. If you mess with your boot
process, expect something bad to happen but maybe don't let that stop
you from experimenting.
</p>

<div id="outline-container-org3ec1f29" class="outline-2">
<h2 id="org3ec1f29">Before installing</h2>
<div class="outline-text-2" id="text-org3ec1f29">
<p>
It's good to understand some aspects of the OS X/macOS system
(hereafter "macOS") before making adjustments. Most important
are firmware updates, Apple's UEFI implementation, and <kbd>bless(8)</kbd>.
</p>
</div>

<div id="outline-container-org006e5e8" class="outline-3">
<h3 id="org006e5e8">Firmware updates</h3>
<div class="outline-text-3" id="text-org006e5e8">
<p>
The easiest (and only, AFAIK) way to update firmware is through the
"Software Update" feature of macOS. For that reason, it's a good idea
to retain a bootable copy of macOS, either as a partition on the same
drive as Linux or on a separate drive entirely. It might also be a
good idea to make a bootable macOS installer. See <a href="https://support.apple.com/en-us/HT201371">Apple's guide</a> for
instructions.
</p>
</div>
</div>

<div id="outline-container-org67653ee" class="outline-3">
<h3 id="org67653ee">UEFI</h3>
<div class="outline-text-3" id="text-org67653ee">
<p>
On startup, a macbook boots to whichever EFI entry has the highest
priority. The process can be interrupted by holding a certain key
combination at startup (see <a href="https://support.apple.com/en-us/HT201255">Mac startup key combinations</a>) to trigger
Apple's rudimentary boot manager. If you forget to hold the correct
key combination at startup, the UEFI may boot an entry you did not
intend, at which point you will have to reboot and try again.
</p>
</div>
</div>

<div id="outline-container-orga1612e5" class="outline-3">
<h3 id="orga1612e5"><kbd>bless(8)</kbd></h3>
<div class="outline-text-3" id="text-orga1612e5">
<p>
The <kbd>bless</kbd> utility is widely reported to be buggy, which matches my
experience with it. I would recommend using <kbd>efibootmgr</kbd> (the standard
alternative on Linux) entirely.
</p>
</div>
</div>

<div id="outline-container-org181fec6" class="outline-3">
<h3 id="org181fec6">EFI System Partition (ESP)</h3>
<div class="outline-text-3" id="text-org181fec6">
<p>
By default, Apple's Disk Utility hides the ESP. You can still mount it
from a terminal:
</p>
<div class="org-src-container">
<pre class="src src-bash">diskutil list
mkdir /Volumes/efi
sudo mount -t msdos /dev/diskXsY /Volumes/efi
</pre>
</div>
<p>
(where <kbd>diskXsY</kbd> is the ESP as ascertained by <kbd>diskutil list</kbd>)
</p>
</div>
</div>
</div>

<div id="outline-container-org6970629" class="outline-2">
<h2 id="org6970629">Installing Linux</h2>
<div class="outline-text-2" id="text-org6970629">
<p>
There are a number of ways to structure the process of booting Linux,
which will include some number of the following components:
</p>
<ul class="org-ul">
<li>Apple's UEFI implementation</li>
<li>A boot manager, such as rEFInd or rEFIt</li>
<li>A boot loader, such as GRUB2</li>
<li>An initial ramdisk (to be passed, along with the kernel, to the
bootloader)</li>
<li>A Linux kernel, perhaps with an EFI-stub</li>
</ul>

<p>
Your use case should dictate which structure you choose. If you plan
on regularly booting to different operating systems, you should use
the <a href="https://www.rodsbooks.com/refind/">rEFInd</a> boot manager (if only so that you don't have to remember to
press the correct key combination at every startup). If you want a
user-friendly boot process that will (probably) "just work" then you
should also use rEFInd. If you're installing a popular
Linux distribution as-is OOTB, you'll probably use a Linux kernel
(without EFI stub) and an initial ramdisk. If you want a simple boot
process with as few steps as possible, you can get away with booting
an EFI kernel stub (without even an initial ramdisk) directly from
Apple's UEFI.
</p>
</div>

<div id="outline-container-org8e4b6c1" class="outline-3">
<h3 id="org8e4b6c1">Using the rEFInd boot manager</h3>
<div class="outline-text-3" id="text-org8e4b6c1">
<p>
rEFInd has great documentation where you can find installation
instructions and a detailed feature list. There are two primary ways
to use rEFInd: invoke a Linux kernel bootloader (e.g. GRUB2) or load a
Linux kernel EFI stub.
</p>
</div>

<div id="outline-container-org1559a85" class="outline-4">
<h4 id="org1559a85">Invoking the GRUB2 bootloader from rEFInd</h4>
<div class="outline-text-4" id="text-org1559a85">
<p>
This is the "standard" way of dual-booting Linux. Installation might
look like this:
</p>
<ol class="org-ol">
<li>Install rEFInd</li>
<li>Insert installation media of a chosen GNU/Linux distribution</li>
<li>Reboot</li>
<li>In the rEFInd menu, select the installation media as the boot target</li>
<li>Follow installation instructions (at some point, the installer will
automatically add a boot entry to the ESP partition)</li>
<li>Reboot</li>
<li>In the rEFInd menu, you can choose from the boot targets that
rEFInd has found in the ESP partition</li>
</ol>
<p>
You're dual-booting!
</p>
</div>
</div>

<div id="outline-container-org2bd630b" class="outline-4">
<h4 id="org2bd630b">Loading a kernel EFI stub from rEFInd</h4>
<div class="outline-text-4" id="text-org2bd630b">
<p>
This method is very similar to the above, but may require a more
manual installation process. For a how-to, see
<a href="https://www.makeuseof.com/tag/install-linux-macbook-pro/">https://www.makeuseof.com/tag/install-linux-macbook-pro/</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orga613946" class="outline-3">
<h3 id="orga613946">Using Apple's boot manager</h3>
<div class="outline-text-3" id="text-orga613946">
<p>
You may be able to get by without a third-party boot manager. However,
on some Apple hardware, booting non-macOS operating systems from EFI
may result in improper hardware initialization (see <a href="https://regebro.wordpress.com/2008/11/16/installing-linux-on-a-macbook-without-os-x/">this story</a> for an
example). In such cases, it might be necessary to use rEFInd to force
proper initialization (or at least to use a bootloader in BIOS compatibility
mode, like GRUB2).
</p>

<p>
Again, you can invoke a bootloader or load an EFI stub.
</p>
</div>

<div id="outline-container-orgf5b260b" class="outline-4">
<h4 id="orgf5b260b">Invoking GRUB2 from Apple's UEFI</h4>
<div class="outline-text-4" id="text-orgf5b260b">
<p>
For a full guide, see:
</p>
<ul class="org-ul">
<li>This <a href="https://askubuntu.com/questions/831161/dual-booting-os-x-or-macos-with-linux-without-refind/1272785#1272785">stackoverflow post</a></li>
<li><a href="https://glandium.org/blog/?p=2830">https://glandium.org/blog/?p=2830</a></li>
</ul>
</div>
</div>

<div id="outline-container-org315a318" class="outline-4">
<h4 id="org315a318">Loading a Linux kernel with EFI stub from Apple's UEFI</h4>
<div class="outline-text-4" id="text-org315a318">
<p>
This <a href="https://stackoverflow.com/questions/28842865/passing-kernel-parametes-to-efi-stub-in-apples-efi-env/">stackoverflow post</a> has full instructions. They boil down to:
</p>
<ol class="org-ol">
<li>Create an <kbd>HFS+</kbd> partition large enough to hold a kernel stub and
(optionally) initial ramdisk (which were ~6MB and ~36MB in my
experience)</li>
<li>Copy the kernel stub and initial ramdisk to the partition</li>
<li>Rename the kernel stub so that it ends with <kbd>.efi</kbd></li>
<li><p>
Create a new boot entry pointing to your new partition:
</p>
<div class="org-src-container">
<pre class="src src-bash">efibootmgr -d /dev/sdX -p Y -c -L <span style="color: #8b2252;">"Debian (EFI-Stub)"</span> -l /vmlinuz.efi -u <span style="color: #8b2252;">"root=UUID=xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx ro quiet splash initrd=\initrd.img"</span>
</pre>
</div></li>
</ol>
<p>
Note: see this <a href="https://askubuntu.com/questions/831161/dual-booting-os-x-or-macos-with-linux-without-refind#comment2103658_832609">stackoverflow comment</a> by the author of rEFInd for
thoughts about this boot sequence.
</p>
</div>

<ul class="org-ul">
<li><a id="orge7f2433"></a>Without initial ramdisk<br />
<div class="outline-text-5" id="text-orge7f2433">
<p>
The same steps apply, but you must use <kbd>root=PARTUUID=...</kbd> instead of
<kbd>root=UUID=...</kbd>. See this <a href="https://www.reddit.com/r/Gentoo/comments/ivrfyf/comment/g5ujnm1/">reddit comment</a> for an explanation.
</p>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8d622c9" class="outline-2">
<h2 id="org8d622c9">Troubleshooting</h2>
<div class="outline-text-2" id="text-org8d622c9">
<ul class="org-ul">
<li>Unable to partition disk, even though there should be room
<ul class="org-ul">
<li><a href="https://discussions.apple.com/thread/8501670">https://discussions.apple.com/thread/8501670</a></li>
</ul></li>
<li>macOS partition unbootable after creating partition
<ul class="org-ul">
<li><a href="https://discussions.apple.com/thread/6511990">https://discussions.apple.com/thread/6511990</a></li>
<li><a href="https://ipfs-sec.stackexchange.cloudflare-ipfs.com/apple/A/question/282550.html">https://ipfs-sec.stackexchange.cloudflare-ipfs.com/apple/A/question/282550.html</a></li>
<li><a href="https://apple.stackexchange.com/questions/238012/os-volume-shows-as-type-ffffffff-ffff-ffff-ffff-ffffffff-after-attempting-to-d/238088#238088">https://apple.stackexchange.com/questions/238012/os-volume-shows-as-type-ffffffff-ffff-ffff-ffff-ffffffff-after-attempting-to-d/238088#238088</a></li>
<li><a href="https://apple.stackexchange.com/questions/307780/macos-partition-startup-volume-type-ffffffff-ffff-ffff-ffff-ffffffffffff">https://apple.stackexchange.com/questions/307780/macos-partition-startup-volume-type-ffffffff-ffff-ffff-ffff-ffffffffffff</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7ca0713" class="outline-2">
<h2 id="org7ca0713">References</h2>
<div class="outline-text-2" id="text-org7ca0713">
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/linux/comments/4rnufy/people_who_run_linux_on_macbooks_is_it_worth_it/">https://www.reddit.com/r/linux/comments/4rnufy/people_who_run_linux_on_macbooks_is_it_worth_it/</a></li>
<li><a href="https://www.reddit.com/r/hackintosh/comments/7sprm3/is_it_possible_to_run_a_hackintosh_off_an/">https://www.reddit.com/r/hackintosh/comments/7sprm3/is_it_possible_to_run_a_hackintosh_off_an/</a></li>
<li><a href="https://wiki.archlinux.org/index.php/Mac#Firmware_updates">https://wiki.archlinux.org/index.php/Mac#Firmware_updates</a></li>
<li><a href="https://askubuntu.com/questions/894036/what-is-the-current-best-way-to-dual-boot-a-mac-with-ubuntu-on-the-latest-10-12">https://askubuntu.com/questions/894036/what-is-the-current-best-way-to-dual-boot-a-mac-with-ubuntu-on-the-latest-10-12</a></li>
<li><a href="https://www.reddit.com/r/Gentoo/comments/ivrfyf/kernel_panic_on_boot/">https://www.reddit.com/r/Gentoo/comments/ivrfyf/kernel_panic_on_boot/</a></li>
<li><a href="https://askubuntu.com/questions/831161/dual-booting-os-x-or-macos-with-linux-without-refind">https://askubuntu.com/questions/831161/dual-booting-os-x-or-macos-with-linux-without-refind</a></li>
<li><a href="https://themacadmin.com/2012/02/15/mounting-the-efi-boot-partition-on-mac-os-x/">https://themacadmin.com/2012/02/15/mounting-the-efi-boot-partition-on-mac-os-x/</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
